       identification division.
       program-id. a.
       data division.
       working-storage section.
       01 n pic 9.
       procedure division.
         go to bb-1 bb-2 depending on n.
       bb-1.
       bb-2.
